{"pageProps":{"post":{"id":"importing-sql-dump-into-docker-container-using-wsl","title":"Importing a SQL Dump Into Docker Container Using WSL","description":"Import a SQL dump from the WSL host machine into a docker container","categories":["Docker","WSL"],"tags":["beginner","utility"],"content":"\n## Introduction\nWhen working with Docker containers and WSL (Windows Subsystem for Linux), it's common to encounter scenarios where you need to import a SQL dump into a database running inside a Docker container. This process is essential for tasks such as setting up development environments or migrating databases.\n\n## The Command\nTo achieve this, you can use the docker exec command along with the MySQL client inside the Docker container. The command has a generic structure, making it adaptable to various scenarios:\n\n```bash\ndocker exec -i your_container_name_or_id mysql -u your_username -pyour_password your_database_name < /path/to/your/sql_dump.sql\n```\n\nReplace the placeholders with your specific details:\n\nyour_container_name_or_id: The name or ID of your Docker container.\nyour_username: Your MySQL database username.\nyour_password: Your MySQL database password.\nyour_database_name: The name of the database you want to import into.\n/path/to/your/sql_dump.sql: The path to the SQL dump file on your WSL host machine.\n\n## Understanding the Filepath in WSL\nIn the provided example command below:\n\n```bash\ndocker exec -i my-app-db-1 mysql -u user -ppassword my_app_schema < /mnt/e/Downloads/db-dump.sql\n```\n\nThe file path `/mnt/e/Downloads/db-dump.sql` refers to a location on the Windows filesystem accessible from within WSL. In WSL, the filesystem is mounted under the /mnt directory, with each drive having its own subdirectory. In this case, the E: drive is accessible under /mnt/e/.\n\nTherefore, the full Windows path is `E:\\Downloads\\db-dump.sql`, and within WSL, it is represented as `/mnt/e/Downloads/db-dump.sql`. This allows seamless interaction between WSL and Windows, enabling you to access and manipulate files across both environments.\n\n## Conclusion\nIn conclusion, importing a SQL dump into a Docker container using WSL proves to be a straightforward process with the right command structure. Leveraging the flexibility of the docker exec command along with the MySQL client within the Docker container allows for seamless database setup and migration. Understanding the nuances of file paths in WSL ensures accurate referencing of files located on the Windows filesystem. By adapting the provided command to your specific configuration, you can efficiently manage database operations in a Dockerized environment integrated with WSL.\n","author":{"name":"Raphael Batagini"},"publishDate":"Sun Dec 03 2023"}},"__N_SSG":true}